IRP/src/AccumulationRegisters/R2012B_SalesOrdersInvoiceClosing/R2012B_SalesOrdersInvoiceClosing.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>R2012B_SalesOrdersInvoiceClosing</name>
 <resources>
  <name>Quantity</name>
  <type>
   <types>DefinedType.typeQuantity</types>
  </type>
 </resources>
 <resources>
  <name>Amount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>NetAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Order</name>
  <type>
   <types>DocumentRef.SalesReturnOrder</types>
   <types>DocumentRef.SalesOrder</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>RowKey</name>
  <type>
   <types>DefinedType.typeRowID</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/Enums/ItemTypes/ItemTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>ItemTypes</name>
 <enumValues>
  <name>Service</name>
 </enumValues>
 <enumValues>
  <name>Product</name>
 </enumValues>
 <enumValues>
  <name>Certificate</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Documents/SalesOrderClosing/SalesOrderClosing.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
 <name>SalesOrderClosing</name>
 <registerRecords>AccumulationRegister.TM1010B_RowIDMovements</registerRecords>
 <registerRecords>AccumulationRegister.R2010T_SalesOrders</registerRecords>
 <registerRecords>AccumulationRegister.R2014T_CanceledSalesOrders</registerRecords>
 <registerRecords>AccumulationRegister.R6510B_StockBalance</registerRecords>
 <registerRecords>AccumulationRegister.T1040T_RowIDSerialLotNumbers</registerRecords>
 <registerRecords>AccumulationRegister.B1040B_AgingKey</registerRecords>
 <registerRecords>AccumulationRegister.R2011B_SalesOrdersShipment</registerRecords>
 <registerRecords>InformationRegister.T2014S_AdvancesInfo</registerRecords>
 <registerRecords>AccumulationRegister.R3026B_SalesOrdersCustomerAdvance</registerRecords>
 <registerRecords>AccumulationRegister.R2021B_CustomersTransactions</registerRecords>
 <registerRecords>AccumulationRegister.R4011B_FreeStocks</registerRecords>
 <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
 <registerRecords>AccumulationRegister.R4012B_StockReservation</registerRecords>
 <registerRecords>AccumulationRegister.R5020B_PartnersBalance</registerRecords>
 <registerRecords>AccumulationRegister.R2013T_SalesOrdersProcurement</registerRecords>
 <registerRecords>AccumulationRegister.R5011B_CustomersAging</registerRecords>
 <registerRecords>AccumulationRegister.R2020B_AdvancesFromCustomers</registerRecords>
 <registerRecords>AccumulationRegister.R4034B_GoodsShipmentSchedule</registerRecords>
 <registerRecords>AccumulationRegister.T1040T_AccountingAmounts</registerRecords>
 <registerRecords>AccumulationRegister.R3024B_SalesOrdersToBePaid</registerRecords>
 <registerRecords>AccumulationRegister.R2012B_SalesOrdersInvoiceClosing</registerRecords>
 <attributes>
  <name>Agreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </attributes>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>LegalName</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>SalesOrder</name>
  <type>
   <types>DocumentRef.SalesOrder</types>
  </type>
 </attributes>
 <attributes>
  <name>TransactionType</name>
  <type>
   <types>EnumRef.SalesTransactionTypes</types>
  </type>
 </attributes>
 <tabularSections>
  <name>ItemList</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Cancel</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>CancelReason</name>
   <type>
    <types>CatalogRef.CancelReturnReasons</types>
   </type>
  </attributes>
  <attributes>
   <name>Item</name>
   <type>
    <types>CatalogRef.Items</types>
   </type>
  </attributes>
  <attributes>
   <name>ItemKey</name>
   <type>
    <types>CatalogRef.ItemKeys</types>
   </type>
  </attributes>
  <attributes>
   <name>Store</name>
   <type>
    <types>CatalogRef.Stores</types>
   </type>
  </attributes>
  <attributes>
   <name>Quantity</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>QuantityInBaseUnit</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>Unit</name>
   <type>
    <types>CatalogRef.Units</types>
   </type>
  </attributes>
  <attributes>
   <name>DeliveryDate</name>
   <type>
    <types>Date</types>
    <dateQualifiers>
     <dateFractions>Date</dateFractions>
    </dateQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ProcurementMethod</name>
   <type>
    <types>EnumRef.ProcurementMethods</types>
   </type>
  </attributes>
  <attributes>
   <name>SalesOrderKey</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>SalesPerson</name>
   <type>
    <types>CatalogRef.Partners</types>
   </type>
  </attributes>
  <attributes>
   <name>IsService</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>QuantityIsFixed</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Project</name>
   <type>
    <types>CatalogRef.Projects</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Document>

IRP/src/CommonModules/DocSalesOrderClosingServer/Module.bsl
#Region FROM

Procedure OnCreateAtServer(Object, Form, Cancel, StandardProcessing) Export
	DocumentsServer.OnCreateAtServer(Object, Form, Cancel, StandardProcessing);
	If Form.Parameters.Key.IsEmpty() Then
		SetGroupItemsList(Object, Form);
		DocumentsClientServer.ChangeTitleGroupTitle(Object, Form);
	EndIf;
	ViewServer_V2.OnCreateAtServer(Object, Form, "ItemList");
EndProcedure

Procedure AfterWriteAtServer(Object, Form, CurrentObject, WriteParameters) Export
	DocumentsClientServer.ChangeTitleGroupTitle(CurrentObject, Form);
	Form.Taxes_CreateFormControls();
EndProcedure

Procedure OnReadAtServer(Object, Form, CurrentObject) Export
	If Not Form.GroupItems.Count() Then
		SetGroupItemsList(Object, Form);
	EndIf;
	DocumentsClientServer.ChangeTitleGroupTitle(CurrentObject, Form);
	Form.Taxes_CreateFormControls();
EndProcedure

#EndRegion

#Region GroupTitle

Procedure SetGroupItemsList(Object, Form)
	AttributesArray = New Array();
	AttributesArray.Add("Company");
	AttributesArray.Add("Partner");
	AttributesArray.Add("LegalName");
	AttributesArray.Add("Agreement");
	DocumentsServer.DeleteUnavailableTitleItemNames(AttributesArray);
	For Each Attr In AttributesArray Do
		Form.GroupItems.Add(Attr, ?(ValueIsFilled(Form.Items[Attr].Title), Form.Items[Attr].Title,
			Object.Ref.Metadata().Attributes[Attr].Synonym + ":" + Chars.NBSp));
	EndDo;
EndProcedure

#EndRegion

Function CheckItemList(Object) Export

	Query = New Query();
	Query.Text =
	"SELECT
	|	Table.LineNumber As LineNumber,
	|	Table.Store,
	|	Table.ItemKey As ItemKey
	|INTO ItemList
	|FROM
	|	&ItemList AS Table
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	ItemList.Store
	|FROM
	|	ItemList AS ItemList
	|Where
	|	ItemList.ItemKey.Item.ItemType.Type = Value(Enum.ItemTypes.Product)
	|	And
	|	Not ItemList.Store.UseShipmentConfirmation
	|GROUP BY
	|	ItemList.Store";

	Query.SetParameter("ItemList", Object.ItemList.Unload());
	QueryResult = Query.Execute();

	If QueryResult.IsEmpty() Then
		Return "";
	EndIf;

	SelectionDetailRecords = QueryResult.Select();

	Stores = "";
	While SelectionDetailRecords.Next() Do
		If Not Stores = "" Then
			Stores = Stores + ", ";
		EndIf;

		Stores = Stores + String(SelectionDetailRecords.Store);
	EndDo;

	Return StrTemplate(R().Error_064, Stores);
EndFunction

#Region ListFormEvents

Procedure OnCreateAtServerListForm(Form, Cancel, StandardProcessing) Export
	DocumentsServer.OnCreateAtServerListForm(Form, Cancel, StandardProcessing);
EndProcedure

#EndRegion

#Region ChoiceFormEvents

Procedure OnCreateAtServerChoiceForm(Form, Cancel, StandardProcessing) Export
	DocumentsServer.OnCreateAtServerChoiceForm(Form, Cancel, StandardProcessing);
EndProcedure

#EndRegion

#Region SalesOrderClosing

Function GetLastSalesOrderClosingBySalesOrder(SalesOrder) Export

	SalesOrderClosing = Documents.SalesOrderClosing.EmptyRef();

	Query = New Query();
	Query.Text =
	"SELECT
	|	SalesOrderClosing.Ref
	|FROM
	|	Document.SalesOrderClosing AS SalesOrderClosing
	|WHERE
	|	SalesOrderClosing.Posted
	|	AND SalesOrderClosing.SalesOrder = &SalesOrder";

	Query.SetParameter("SalesOrder", SalesOrder);

	QueryResult = Query.Execute();

	If Not QueryResult.IsEmpty() Then
		SelectionDetailRecords = QueryResult.Select();
		SelectionDetailRecords.Next();
		SalesOrderClosing = SelectionDetailRecords.Ref;
	EndIf;

	Return SalesOrderClosing;

EndFunction

Function GetSalesOrderForClosing(SalesOrder, AddInfo = Undefined) Export

	Query = New Query();
	Query.Text =
	"SELECT
	|	""SalesOrder"" AS BasedOn,
	|	TRUE AS CloseOrder,
	|	SalesOrder.Ref AS SalesOrder,
	|	SalesOrder.Agreement AS Agreement,
	|	SalesOrder.Company AS Company,
	|	SalesOrder.Currency AS Currency,
	|	SalesOrder.DateOfShipment AS DateOfShipment,
	|	SalesOrder.LegalName AS LegalName,
	|	SalesOrder.ManagerSegment AS ManagerSegment,
	|	SalesOrder.Partner AS Partner,
	|	SalesOrder.PriceIncludeTax AS PriceIncludeTax,
	|	SalesOrder.Status AS Status,
	|	SalesOrder.UseItemsShipmentScheduling AS UseItemsShipmentScheduling,
	|	SalesOrder.Author AS Author,
	|	SalesOrder.Branch AS Branch,
	|	SalesOrder.Description AS Description
	|FROM
	|	Document.SalesOrder AS SalesOrder
	|WHERE
	|	SalesOrder.Ref = &SalesOrder
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	ItemList.Ref AS Ref,
	|	ItemList.LineNumber AS LineNumber,
	|	ItemList.Key AS Key,
	|	ItemList.Cancel AS Cancel1,
	|	ItemList.Item AS Item,
	|	ItemList.ItemKey AS ItemKey,
	|	ItemList.Store AS Store,
	|	ItemList.Price AS Price,
	|	ItemList.PriceType AS PriceType,
	|	ItemList.ItemKey.Item.Unit AS Unit,
	|	ItemList.DeliveryDate AS DeliveryDate,
	|	ItemList.ProcurementMethod AS ProcurementMethod,
	|	ItemList.Detail AS Detail,
	|	ItemList.ProfitLossCenter AS ProfitLossCenter,
	|	ItemList.RevenueType AS RevenueType,
	|	ItemList.DontCalculateRow AS DontCalculateRow,
	|	ItemList.CancelReason AS CancelReason,
	|	SalesOrdersInvoiceClosing.QuantityBalance > 0 AS Cancel,
	|	CASE
	|		WHEN SalesOrdersInvoiceClosing.QuantityBalance > 0
	|			THEN SalesOrdersInvoiceClosing.QuantityBalance
	|		ELSE -1 * SalesOrdersInvoiceClosing.QuantityBalance
	|	END AS QuantityInBaseUnit,
	|	CASE
	|		WHEN SalesOrdersInvoiceClosing.QuantityBalance > 0
	|			THEN SalesOrdersInvoiceClosing.QuantityBalance
	|		ELSE -1 * SalesOrdersInvoiceClosing.QuantityBalance
	|	END AS Quantity,
	|	CASE
	|		WHEN SalesOrdersInvoiceClosing.AmountBalance > 0
	|			THEN SalesOrdersInvoiceClosing.AmountBalance
	|		ELSE -1 * SalesOrdersInvoiceClosing.AmountBalance
	|	END AS TotalAmount,
	|	CASE
	|		WHEN SalesOrdersInvoiceClosing.NetAmountBalance > 0
	|			THEN SalesOrdersInvoiceClosing.NetAmountBalance
	|		ELSE -1 * SalesOrdersInvoiceClosing.NetAmountBalance
	|	END AS NetAmount,
	|	ItemList.TaxAmount AS TaxAmount,
	|	ItemList.OffersAmount AS OffersAmount,
	|	ItemList.SalesPerson
	|FROM
	|	Document.SalesOrder.ItemList AS ItemList
	|		INNER JOIN AccumulationRegister.R2012B_SalesOrdersInvoiceClosing.Balance(, Order = &SalesOrder) AS
	|			SalesOrdersInvoiceClosing
	|		ON ItemList.Key = SalesOrdersInvoiceClosing.RowKey
	|WHERE
	|	ItemList.Ref = &SalesOrder
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	SalesOrderSpecialOffers.Ref AS Ref,
	|	SalesOrderSpecialOffers.LineNumber AS LineNumber,
	|	SalesOrderSpecialOffers.Key AS Key,
	|	SalesOrderSpecialOffers.Offer AS Offer,
	|	SalesOrderSpecialOffers.Amount AS Amount,
	|	SalesOrderSpecialOffers.Percent AS Percent
	|FROM
	|	Document.SalesOrder.SpecialOffers AS SalesOrderSpecialOffers
	|WHERE
	|	FALSE
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	SalesOrderTaxList.Ref AS Ref,
	|	SalesOrderTaxList.LineNumber AS LineNumber,
	|	SalesOrderTaxList.Key AS Key,
	|	SalesOrderTaxList.Tax AS Tax,
	|	SalesOrderTaxList.Analytics AS Analytics,
	|	SalesOrderTaxList.TaxRate AS TaxRate,
	|	SalesOrderTaxList.Amount AS Amount,
	|	SalesOrderTaxList.IncludeToTotalAmount AS IncludeToTotalAmount,
	|	SalesOrderTaxList.ManualAmount AS ManualAmount
	|FROM
	|	Document.SalesOrder.TaxList AS SalesOrderTaxList
	|WHERE
	|	FALSE";
	Query.SetParameter("SalesOrder", SalesOrder);
	QueryResults = Query.ExecuteBatch();
	
	Header              = QueryResults[0].Unload()[0];
	Table_ItemList      = QueryResults[1].Unload();
	Table_SpecialOffers = QueryResults[2].Unload();
	Table_TaxList       = QueryResults[3].Unload();
	
	// ItemList
	ArrayOfColumns = New Array();
	For Each Column In Table_ItemList.Columns Do
		ArrayOfColumns.Add(Column.Name);
	EndDo;
	Columns_ItemList = StrConcat(ArrayOfColumns, ",");
	
	// SpecialOffers
	ArrayOfColumns.Clear();
	For Each Column In Table_SpecialOffers.Columns Do
		ArrayOfColumns.Add(Column.Name);
	EndDo;
	Columns_SpecialOffers = StrConcat(ArrayOfColumns, ",");
	
	// TaxList
	ArrayOfColumns.Clear();
	For Each Column In Table_TaxList.Columns Do
		ArrayOfColumns.Add(Column.Name);
	EndDo;
	Columns_TaxList = StrConcat(ArrayOfColumns, ",");
	
	FillingValues = New Structure("BasedOn,
								  |CloseOrder,
								  |SalesOrder,
								  |Agreement, 
								  |Company, 
								  |Currency, 
								  |DateOfShipment, 
								  |LegalName, 
								  |ManagerSegment, 
								  |Partner, 
								  |PriceIncludeTax, 
								  |Status, 
								  |UseItemsShipmentScheduling, 
								  |Author, 
								  |Branch, 
								  |Description");
	
	FillingValues.Insert("ItemList"      , New Array());
	FillingValues.Insert("TaxList"       , New Array());
	FillingValues.Insert("SpecialOffers" , New Array());
	FillPropertyValues(FillingValues, Header);
	
	For Each Row In Table_ItemList Do
		ItemRowInSO = SalesOrder.ItemList.FindRows(New Structure("Key", Row.Key))[0];
		QuantityPart = Row.QuantityInBaseUnit / ItemRowInSO.QuantityInBaseUnit;

		TaxRowInSO = SalesOrder.TaxList.FindRows(New Structure("Key", Row.Key));
		TaxAmount = 0;
		For Each TaxRow In TaxRowInSO Do
			NewRow_TaxList = New Structure(Columns_TaxList);
			FillPropertyValues(NewRow_TaxList, TaxRow);
			NewRow_TaxList.Amount = TaxRow.Amount * QuantityPart;
			NewRow_TaxList.ManualAmount = TaxRow.ManualAmount * QuantityPart;
			TaxAmount = TaxAmount + NewRow_TaxList.ManualAmount;
			FillingValues.TaxList.Add(NewRow_TaxList);
		EndDo;
		Row.TaxAmount = TaxAmount;
		
		SpecialOffersRowInSO = SalesOrder.SpecialOffers.FindRows(New Structure("Key", Row.Key));
		SpecialOffersAmount = 0;
		For Each SpecialOffersRow In SpecialOffersRowInSO Do
			NewRow_SpecialOffers = New Structure(Columns_SpecialOffers);
			FillPropertyValues(NewRow_SpecialOffers, SpecialOffersRow);
			NewRow_SpecialOffers.Amount = SpecialOffersRow.Amount * QuantityPart;
			SpecialOffersAmount = SpecialOffersAmount + NewRow_SpecialOffers.Amount;
			FillingValues.SpecialOffers.Add(NewRow_SpecialOffers);
		EndDo;
		Row.OffersAmount = SpecialOffersAmount;
		
		NewRow_ItemList = New Structure(Columns_ItemList);
		FillPropertyValues(NewRow_ItemList, Row);
		FillingValues.ItemList.Add(NewRow_ItemList);
	EndDo;
	
	Return FillingValues;
EndFunction

#EndRegion
